{
  "top_discrimination": {
    "column": "discrimination",
    "limit": 0.7,
    "comparison_operator": "\u003e",
    "heading": "Top Discrimination Index",
    "text": "Questions with a discrimination index above {limit} effectively differentiate between individuals with varying levels of the measured construct, making them valuable for future tests. These questions contribute to the reliability and validity of the assessment by accurately ranking and measuring individual differences. Retaining high-discriminating questions helps maintain the test\u0027s difficulty level and ensures it remains a robust tool for assessing knowledge or skills.\n\nThe discrimination index measures the item\u0027s ability to distinguish between high and low performers on a test. It is calculated by comparing the proportion of examinees of the top 27% of participants (in terms of assessment score) minus the lowest 27% on a particular item. A discrimination index above {limit} indicates strong discriminative power, reflecting the item\u0027s effectiveness in differentiating between individuals with varying levels of the construct being measured.\n\nThe following **{questions} (out of {total})** item{plural} a high discrimination index, this represents **{percent}%** of all the questions:\n"
  },
  "negative_discrimination": {
    "column": "discrimination",
    "limit": 0,
    "comparison_operator": "\u003c",
    "heading": "Negative Discrimination Index",
    "text": "The discrimination index, also known as the item discrimination, measures the ability of an item to differentiate between high-scoring and low-scoring individuals on a test.\n\nA negative discrimination index for a test item indicates that individuals who scored higher on the overall test performed worse on that particular item compared to individuals who scored lower on the overall test. In other words, individuals who are more knowledgeable or proficient in the construct being measured by the test are more likely to answer the item incorrectly.\n\nA negative discrimination index suggests that the item is \"reverse-scored\" or \"keyed negatively\" compared to the other items in the test. It means that the item is counterintuitive or confusing to test takers, as higher-scoring individuals are more likely to select incorrect responses, while lower-scoring individuals are more likely to select correct responses.\n\nIn practical terms, a negative discrimination index indicates that the item may be problematic and should be carefully reviewed. It may suggest the need to revise the item or consider removing it from the test if it is not effectively measuring the construct of interest. Negative discrimination can adversely affect the reliability and validity of a test, as it undermines the test\u0027s ability to accurately rank individuals according to their level of the measured trait or construct.\n\nThe following **{questions} (out of {total})** item{plural} a negative discrimination index, this represents **{percent}%** of all the questions:\n\n"
  },
  "low_correlation": {
    "column": "correlation",
    "limit": 0.2,
    "comparison_operator": "\u003c",
    "heading": "Low Correlation Index",
    "text": "The following questions may need to be checked as they have a low correlation index. A low point biserial correlation indicates a weak relationship between the item response and the total test score.\n\nSpecifically, a low point biserial correlation suggests that the item is not effectively discriminating between examinees who perform well on the test and those who perform poorly. It indicates that the item is not differentiating between individuals with higher and lower levels of the latent trait or construct being measured by the test.\n\nIn practical terms, a low point biserial correlation implies that the item may not be a good indicator of the test takers\u0027 overall ability or proficiency in the tested domain. It may suggest that the item needs to be reviewed or revised to improve its ability to discriminate between individuals with different levels of the construct..\n\nThe following **{questions} (out of {total})** item{plural} a low correlation index, this represents **{percent}%** of all the questions:\n"
  }
}